{"keywords":[],"title":"Instant Pot Turkey Breast and Gravy","prep_time":"1 hour 25 minutes","author_name":"Coco Morante","origin":"https://www.simplyrecipes.com/instant-pot-turkey-breast-and-gravy-recipe-5207290","description":"Making turkey breast and gravy in the Instant Pot is a lot faster than roasting a whole bird in the oven, dirties fewer dishes, and works great for a small gathering!","servings":{"value":6},"ingredients":[{"count":{"value":1,"num":1,"den":2},"unit":"tbsp","name":"unsalted butter at room temperature","plural":true},{"count":{"value":1,"num":1,"den":2},"unit":"tsp","name":"kosher salt","plural":true},{"count":{"num":1,"den":2},"unit":"tsp","name":"freshly ground black pepper","plural":false},{"count":{"value":1},"unit":"tsp","name":"paprika","plural":false},{"count":{"value":4},"unit":"tsp","name":"combination chopped fresh sage rosemary oregano","plural":true},{"count":{"value":1},"unit":"","name":"skinon bone-in whole","note":"4 1/2 pounds or smaller","plural":false},{"count":{"value":1},"unit":"tbsp","name":"olive oil","plural":false},{"count":{"value":2},"unit":"","name":"medium yellow onions cut into 1/4-inch slices","plural":false},{"count":{"value":4},"unit":"","name":"cloves garlic peeled","plural":false},{"count":{"value":2},"unit":"cup","name":"low-sodium chicken broth","plural":true},{"count":{"value":2},"unit":"tbsp","name":"all-purpose flour","plural":true}],"directions":[{"name":"Make the turkey seasoning","sections":[" In a small bowl, stir the butter, salt, black pepper, paprika, and 3 teaspoons of chopped herbs."]},{"name":"Trim and season the turkey","sections":[" If needed, place the turkey breast on a cutting board and using a sharp knife trim the turkey breast of any excess neck bone, rib bones that go beyond the breasts, or extra skin","Pat the turkey breast dry with paper towels","Use your fingers to rub the butter mixture all over the turkey breast."]},{"name":"Cook the onions and garlic","sections":[" Select the Sauté setting on the Instant Pot and add the olive oil","When the olive oil is hot (after about 2 minutes), add the onions and garlic","Sauté until the onions are softened and browned, about 8 minutes."]},{"name":"Add the broth","sections":[" Stir in the chicken broth and the remaining 1 teaspoon of the chopped herbs","Use a wooden spoon to scrape up any browned bits from the bottom of the pot."]},{"name":"Transfer turkey breasts into Instant Pot","sections":[" Place a steam wire rack in the Instant Pot on top of the onions and garlic","Make sure the two handles are facing upwards","This will help you pull it out after the turkey cooks","Place the turkey breast on the steam wire rack."]},{"name":"Cook the turkey breast","sections":[" Secure the lid on the Instant Pot and make sure the vent on the lid is turned to sealing, not venting","Select the Pressure Cook or Manual setting and set the cooking time to 35 minutes at high pressure","The Instant Pot will take about 15 minutes to come up to pressure before the cooking program begins."]},{"name":"Release the pressure","sections":[" When the cooking program ends, carefully (the steam will be very hot, so use heat-resistant oven mitts or use a kitchen towel) release the pressure in the pot by moving the vent on the lid from sealing to venting","When the pressure has fully released (you will stop hearing a hissing sound, and the float valve will sink down), open the Instant Pot","Press the Cancel button to reset the cooking program."]},{"name":"Check for doneness","sections":[" Use a meat thermometer to take the temperature of the turkey breast at its thickest part","It should be at least 165ºF","If the temperature is below 165ºF, secure the lid back on and cook the turkey on the Manual setting at high pressure for another 5 minutes."]},{"name":"Crisp the skin: Using and Air Fryer lid","sections":[" If you have an air fryer lid for your Instant Pot, place it on top.","n the Broil setting, set it to 400ºF and 10 minutes. When the broil"]},{"name":"g program ends, press the Cancel button to reset it. Using the oven","sections":[" If you don’t have an air fryer lid, set the oven to broil on high","The oven rack should be set so that the turkey breast is 6 to 8 inches from the heating element, but it should also be low enough to fit the pot insert","Transfer the Instant Pot’s stainless steel inner pot with the turkey breast into the oven","Broil for about 5 minutes, or until the skin is browned, checking often to make sure that it has not burned."]},{"name":"Remove the turkey from the Instant Pot","sections":[" Whether you transferred the stainless steel inner pot to the oven or used the air fryer lid on the Instant Pot to crisp the skin, it’s time to remove the turkey and the wire steaming rack from the pot","Wearing heat-resistant oven mitts, grasp the handles of the wire rack and lift the turkey out of the pot","Transfer it to a serving platter or carving board to rest while you finish making the gravy","If you broiled the turkey in the oven, return the stainless steel inner pot into the Instant Pot."]},{"name":"Make the gravy","sections":[" Sprinkle the flour over the onions and cooking liquid","Use an immersion blender to blend the mixture until smooth","If you don’t have an immersion blender, carefully transfer the mixture into a blender to blend until smooth, then transfer it back into the pot","Select the sauté setting on the Instant Pot","Let the gravy simmer for a minute or two until thickened","Turn off the pot."]},{"name":"Carve and serve","sections":[" Use a sharp knife to carve the turkey breast off the rib bones","Carve the meat into 1/2-inch slices and serve with the gravy ladled on top."]}],"nutrition_info":{"servings_size":{},"servings_unit":"","nutrients":[{"count":{"value":531},"unit":"","name":"calories","plural":false},{"count":{"value":7},"unit":"g","name":"carbohydrateContent","plural":false},{"count":{"value":94},"unit":"g","name":"proteinContent","plural":false},{"count":{"value":12},"unit":"g","name":"fatContent","plural":false},{"count":{"value":4},"unit":"g","name":"saturatedFatContent","plural":false},{"count":{"value":249},"unit":"mg","name":"cholesterolContent","plural":false},{"count":{"value":641},"unit":"mg","name":"sodiumContent","plural":false},{"count":{"value":1},"unit":"g","name":"fiberContent","plural":false},{"count":{"value":2},"unit":"g","name":"sugarContent","plural":false},{"count":{},"unit":"g","name":"unsaturatedFatContent","plural":false}]}}