{"keywords":[],"title":"Roasted Spatchcock Chicken (Butterflied Chicken)","prep_time":" 55 minutes","author_name":"Sam | Ahead of Thyme","origin":"https://www.aheadofthyme.com/roasted-spatchcock-chicken-butterflied-chicken/","description":"Quick and easy roasted spatchcock chicken (butterflied chicken) seasoned with garlic and thyme is juicy, tender, delicious and flavourful with minimal prep.","servings":{"value":1},"ingredients":[{"count":{"value":1},"unit":"","name":"whole chicken ","note":"3 to 4 lbs.","plural":false},{"count":{"value":2},"unit":"tbsp","name":"olive oil divided","plural":true},{"count":{"value":1},"unit":"tbsp","name":"salt","plural":false},{"count":{"num":1,"den":2},"unit":"tbsp","name":"ground black pepper","plural":false},{"count":{"value":3},"unit":"","name":"cloves garlic peeled ","note":"+ 1 tablespoon minced","plural":false},{"count":{"value":1},"unit":"","name":"sprig rosemary","plural":false},{"count":{"value":2},"unit":"","measure_b":{"count":{"value":3},"unit":""},"name":"sprigs thyme ","note":"+1 tablespoon chopped","plural":false}],"directions":[{"name":"Spatchcock the Chicken:","sections":["Pat dry the whole chicken completely dry with a paper towel before adding seasoning. This helps create extra crispy skin when roasting.","Place chicken breast-side down on a clean and dry chopping board (wearing disposable gloves helps with easy handling).","Cut along the backbone in the middle with kitchen scissors and remove the backbone, which is about 1-inch wide.","Make a small cut with a knife along the white cartilage that connects the breastbone and remove the breastbone by pulling it out through the cut.","Turn the chicken over with the breast-side up and flatten it out . Tuck the wings under the chicken breasts.","Pat dry the spatchcock chicken again to remove any excess liquid."]},{"name":"Season the Spatchcock Chicken:","sections":["In a small bowl, stir together one tablespoon olive oil, salt and pepper, until combined.","Generously smear the seasoning mixture over the whole chicken inside and out and let it rest on a clean plate for at least 15 minutes.  Make sure the seasoning covers the entire whole chicken including the inside cavity."]},{"name":"Roast the Chicken:","sections":["Preheat the oven to 450F.","Heat a cast-iron skillet on the stove for 5 minutes over medium high heat (or preheat the iron skillet in the oven for 5 minutes). Once the skillet is sizzling hot, sear the chicken by placing chicken breast side down in the hot skillet for 3-5 minutes, until skin gets a little crispy.","Transfer the skillet to the oven and bake the chicken for 30 minutes until the skin on the breasts turns brown. You can add an oven-safe weight over the chicken such as a Dutch oven lid to promote browning.","Remove the skillet from the oven and turn the chicken over with the breast side up. Tuck whole garlic cloves and sprigs of rosemary and thyme underneath the chicken to add flavour.","Combine the remaining oil, chopped thyme and minced garlic in a small bowl and brush the seasoning mixture over the chicken breasts.","Transfer the skillet back into the oven and continue to bake the chicken for another 10 minutes until the internal temperature reaches 165F.","Remove the chicken from oven and place it on a large plate. Let the chicken rest for 15 minutes. Then, carve and serve."]}],"nutrition_info":{"servings_size":{},"servings_unit":"","nutrients":[{"count":{"value":271},"unit":"","name":"calories","plural":false},{"count":{"value":11},"unit":"g","name":"carbohydrateContent","plural":false},{"count":{"value":40},"unit":"g","name":"proteinContent","plural":false},{"count":{"value":11},"unit":"g","name":"fatContent","plural":false},{"count":{"value":22},"unit":"g","name":"saturatedFatContent","plural":false},{"count":{},"unit":"g","name":"transFatContent","plural":false},{"count":{"value":1547},"unit":"mg","name":"cholesterolContent","plural":false},{"count":{"value":13052},"unit":"mg","name":"sodiumContent","plural":false},{"count":{"value":3},"unit":"g","name":"fiberContent","plural":false},{"count":{},"unit":"g","name":"sugarContent","plural":false}]}}